overhead_tests/artillery-different-workflows.yaml
config:
  target: 'unused' # required but not used
  processor: './parallel-different-workflow.js'
  phases:
    - name: 'Warm-up'
      arrivalRate: 549
      duration: 60
      # maxVusers: 1500 # Maximum concurrent virtual users
    # - pause: 2 # 5-second pause phase
    # - name: 'Run'
    #   arrivalRate: 3000
    #   duration: 1
    #   maxVusers: 2000  # Higher concurrency for peak load
scenarios:
  - name: 'Run SDK Workflow'
    flow:
      - function: 'runWorkflow'