overhead_tests/artillery-different-workflows.yaml
config:
  target: 'unused' # required but not used
  processor: './parallel-different-workflow.js'
  phases:
    - name: 'Phase 1'
      arrivalRate: 10
      rampTo: 1000
      maxVusers: 1000
      duration: 60
    # - pause: 2 # 5-second   pause phase
    # - name: 'Run'
    #   arrivalRate: 3000
    #   duration: 1
    #   maxVusers: 2000  # Higher concurrency for peak load
scenarios:
  - name: 'Run SDK Workflow'
    flow:
      - function: 'runWorkflow'