overhead_tests/artillery-different-workflows.yaml
config:
  target: 'unused' # required but not used
  processor: './parallel-different-workflow.js'
  phases:
    - name: "Batch 1"
      arrivalRate: 3000
      duration: 1
    - pause: 10
    # - name: "Batch 2"
    #   arrivalRate: 3000
    #   duration: 1
    # - pause: 10
    # - name: "Batch 3"
    #   arrivalRate: 3000
    #   duration: 1
scenarios:
  - name: 'Run SDK Workflow'
    flow:
      - function: 'runWorkflow'