overhead_tests/artillery-different-workflows.yaml
config:
  target: 'unused' # required but not used
  processor: './parallel-different-workflow.js'
  phases:
    - name: 'Warm-up'
      arrivalRate: 50
      duration: 10
    - name: 'Ramp-up'
      arrivalRate: 200
      duration: 20
      rampTo: 500
    - name: 'Sustained Load'
      arrivalRate: 500
      duration: 30
    - name: 'Peak Test'
      arrivalRate: 750
      duration: 15
scenarios:
  - name: 'Run SDK Workflow'
    flow:
      - function: 'runWorkflow'